In [1]:
%matplotlib inline
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [2]:
import scipy.stats as stats

In [3]:
# Read in the raw data and look at it.
imprisonment_rates_file = "../imprisonment_rates_of_18_24_yos_2000_2012.csv"

imprisionment_rates_df = pd.read_csv(imprisonment_rates_file)
imprisionment_rates_df.head()

  Characteristic  Sex Race/ethnicity  Year  Rate per 100,000   Count
0          Total  NaN            NaN  2000               791  218896
1          Total  NaN            NaN  2001               777  219439
2          Total  NaN            NaN  2002               766  220072
3          Total  NaN            NaN  2003               750  218436
4          Total  NaN            NaN  2004               707  207416

In [4]:
# Race/Ethnicity a duplicate of Characteristic, drop it.

imprisonment_df = imprisionment_rates_df
imprisonment_df = imprisonment_df.drop(['Race/ethnicity'], axis=1)

imprisonment_df.head(50)

                 Characteristic     Sex  Year  Rate per 100,000   Count
0                         Total     NaN  2000               791  218896
1                         Total     NaN  2001               777  219439
2                         Total     NaN  2002               766  220072
3                         Total     NaN  2003               750  218436
4                         Total     NaN  2004               707  207416
5                         Total     NaN  2005               680  200050
6                         Total     NaN  2006               663  196234
7                         Total     NaN  2007               662  197731
8                         Total     NaN  2008               658  199105
9                         Total     NaN  2009               660  201325
10                        Total     NaN  2010               644  198997
11                        Total     NaN  2011               616  192248
12                        Total     NaN  2012               575  180734
13                 Total - Male    Male  2000              1478  209543
14                 Total - Male    Male  2001              1447  209658
15                 Total - Male    Male  2002              1422  209710
16                 Total - Male    Male  2003              1388  207921
17                 Total - Male    Male  2004              1305  196906
18                 Total - Male    Male  2005              1249  189298
19                 Total - Male    Male  2006              1215  185418
20                 Total - Male    Male  2007              1213  186631
21                 Total - Male    Male  2008              1207  188035
22                 Total - Male    Male  2009              1212  190118
23                 Total - Male    Male  2010              1187  187699
24                 Total - Male    Male  2011              1136  181510
25                 Total - Male    Male  2012              1060  170734
26               Total - Female  Female  2000                67    9089
27               Total - Female  Female  2001                71    9724
28               Total - Female  Female  2002                74   10336
29               Total - Female  Female  2003                73   10396
30               Total - Female  Female  2004                73   10464
31               Total - Female  Female  2005                75   10713
32               Total - Female  Female  2006                75   10768
33               Total - Female  Female  2007                76   11044
34               Total - Female  Female  2008                75   11036
35               Total - Female  Female  2009                76   11186
36               Total - Female  Female  2010                75   11277
37               Total - Female  Female  2011                70   10696
38               Total - Female  Female  2012                65    9942
39  Total - White, non-Hispanic     NaN  2000               345   59129
40  Total - White, non-Hispanic     NaN  2001               349   60836
41  Total - White, non-Hispanic     NaN  2002               353   62498
42  Total - White, non-Hispanic     NaN  2003               340   61052
43  Total - White, non-Hispanic     NaN  2004               331   59749
44  Total - White, non-Hispanic     NaN  2005               316   57006
45  Total - White, non-Hispanic     NaN  2006               301   54466
46  Total - White, non-Hispanic     NaN  2007               289   52669
47  Total - White, non-Hispanic     NaN  2008               284   52055
48  Total - White, non-Hispanic     NaN  2009               281   51343
49  Total - White, non-Hispanic     NaN  2010               284   49975

In [5]:
# Fill in NaNs for Sex column.  NaNs are both.
imprisonment_df['Sex'] = imprisonment_df['Sex'].fillna("MF")
imprisonment_df.head()

  Characteristic Sex  Year  Rate per 100,000   Count
0          Total  MF  2000               791  218896
1          Total  MF  2001               777  219439
2          Total  MF  2002               766  220072
3          Total  MF  2003               750  218436
4          Total  MF  2004               707  207416

In [6]:
# Check the cleaned data.
imprisonment_df["Characteristic"].unique()

array(['Total', 'Total - Male', 'Total - Female',
       'Total - White, non-Hispanic', 'Total - Black, non-Hispanic',
       'Total - Hispanic', 'Total - Other race, non-Hispanic',
       'White, non-Hispanic', 'Black, non-Hispanic', 'Hispanic',
       'Other race, non-Hispanic'], dtype=object)

In [7]:
# Check the cleaned data.
imprisonment_df.describe()

              Year  Rate per 100,000          Count
count   195.000000        195.000000     195.000000
mean   2006.000000        921.374359   54568.902564
std       3.751288       1033.971778   63418.156827
min    2000.000000         41.000000     869.000000
25%    2003.000000        123.500000    4726.000000
50%    2006.000000        644.000000   45219.000000
75%    2009.000000       1306.500000   76078.500000
max    2012.000000       5358.000000  220072.000000

In [8]:
# This gets all races and both sexs
try:
    output_data_file = "Cleaned_Imprisonment_Rates.csv"
    imprisonment_df.to_csv(output_data_file)
except:
    print(f"Unable to write file: {output_data_file}")